lkolbly/cmsis-svd/data/Cypress/S6E2DF.svd
        <!-- REGISTER "TTC_PSR" -->
        <register>
          <name>TTC_PSR</name>
          <description>Trace Clock Prescaler Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TTC" -->
            <field>
              <name>TTC</name>
              <description>Trace clock frequency division ratio setting bit</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSW_TMR" -->
        <register>
          <name>CSW_TMR</name>
          <description>Clock Stabilization Wait Time Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SOWT3" -->
            <field>
              <name>SOWT3</name>
              <description>Sub clock stabilization wait time setup bit 3</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOWT2" -->
            <field>
              <name>SOWT2</name>
              <description>Sub clock stabilization wait time setup bit 2</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOWT1" -->
            <field>
              <name>SOWT1</name>
              <description>Sub clock stabilization wait time setup bit 1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOWT0" -->
            <field>
              <name>SOWT0</name>
              <description>Sub clock stabilization wait time setup bit 0</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOWT3" -->
            <field>
              <name>MOWT3</name>
              <description>Main clock stabilization wait time setup bit 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOWT2" -->
            <field>
              <name>MOWT2</name>
              <description>Main clock stabilization wait time setup bit 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOWT1" -->
            <field>
              <name>MOWT1</name>
              <description>Main clock stabilization wait time setup bit 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOWT0" -->
            <field>
              <name>MOWT0</name>
              <description>Main clock stabilization wait time setup bit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PSW_TMR" -->
        <register>
          <name>PSW_TMR</name>
          <description>PLL Clock Stabilization Wait Time Setup Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x17</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PINC" -->
            <field>
              <name>PINC</name>
              <description>PLL input clock select bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "POWT2" -->
            <field>
              <name>POWT2</name>
              <description>PLL clock stabilization wait time setup bit 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "POWT1" -->
            <field>
              <name>POWT1</name>
              <description>PLL clock stabilization wait time setup bit 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "POWT0" -->
            <field>
              <name>POWT0</name>
              <description>PLL clock stabilization wait time setup bit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PLL_CTL1" -->
        <register>
          <name>PLL_CTL1</name>
          <description>PLL Control Register 1</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PLLK3" -->
            <field>
              <name>PLLK3</name>
              <description>PLL input clock frequency division ratio setting bit 3</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLK2" -->
            <field>
              <name>PLLK2</name>
              <description>PLL input clock frequency division ratio setting bit 2</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLK1" -->
            <field>
              <name>PLLK1</name>
              <description>PLL input clock frequency division ratio setting bit 1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLK0" -->
            <field>
              <name>PLLK0</name>
              <description>PLL input clock frequency division ratio setting bit 0</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLM3" -->
            <field>
              <name>PLLM3</name>
              <description>PLL VCO clock frequency division ratio setting bit 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLM2" -->
            <field>
              <name>PLLM2</name>
              <description>PLL VCO clock frequency division ratio setting bit 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLM1" -->
            <field>
              <name>PLLM1</name>
              <description>PLL VCO clock frequency division ratio setting bit 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLM0" -->
            <field>
              <name>PLLM0</name>
              <description>PLL VCO clock frequency division ratio setting bit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PLL_CTL2" -->
        <register>
          <name>PLL_CTL2</name>
          <description>PLL Control Register 2</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PLLN5" -->
            <field>
              <name>PLLN5</name>
              <description>PLL feedback frequency division ratio setting bit 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLN4" -->
            <field>
              <name>PLLN4</name>
              <description>PLL feedback frequency division ratio setting bit 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLN3" -->
            <field>
              <name>PLLN3</name>
              <description>PLL feedback frequency division ratio setting bit 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLN2" -->
            <field>
              <name>PLLN2</name>
              <description>PLL feedback frequency division ratio setting bit 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLN1" -->
            <field>
              <name>PLLN1</name>
              <description>PLL feedback frequency division ratio setting bit 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLN0" -->
            <field>
              <name>PLLN0</name>
              <description>PLL feedback frequency division ratio setting bit 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSV_CTL" -->
        <register>
          <name>CSV_CTL</name>
          <description>CSV control register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7003</resetValue>
          <resetMask>0x7303</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FCD2" -->
            <field>
              <name>FCD2</name>
              <description>FCS count cycle setting bit 2</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCD1" -->
            <field>
              <name>FCD1</name>
              <description>FCS count cycle setting bit 1</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCD0" -->
            <field>
              <name>FCD0</name>
              <description>FCS count cycle setting bit 0</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCSRE" -->
            <field>
              <name>FCSRE</name>
              <description>FCS reset output enable bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCSDE" -->
            <field>
              <name>FCSDE</name>
              <description>FCS function enable bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCSVE" -->
            <field>
              <name>SCSVE</name>
              <description>Sub CSV function enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MCSVE" -->
            <field>
              <name>MCSVE</name>
              <description>Main CSV function enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSV_STR" -->
        <register>
          <name>CSV_STR</name>
          <description>CSV status register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCMF" -->
            <field>
              <name>SCMF</name>
              <description>Sub clock failure detection flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MCMF" -->
            <field>
              <name>MCMF</name>
              <description>Main clock failure detection flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
