lkolbly/cmsis-svd/data/Cypress/S6E2DF.svd
        <!-- REGISTER "IRQ036MON" -->
        <register>
          <name>IRQ036MON</name>
          <description>IRQ036 Batch Read Register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PPGINT2" -->
            <field>
              <name>PPGINT2</name>
              <description>Interrupt request of the PPG ch.4</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PPGINT1" -->
            <field>
              <name>PPGINT1</name>
              <description>Interrupt request of the PPG ch.2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PPGINT0" -->
            <field>
              <name>PPGINT0</name>
              <description>Interrupt request of the PPG ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ037MON" -->
        <register>
          <name>IRQ037MON</name>
          <description>IRQ037 Batch Read Register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PPGINT2" -->
            <field>
              <name>PPGINT2</name>
              <description>Interrupt request of the PPG ch.12</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PPGINT1" -->
            <field>
              <name>PPGINT1</name>
              <description>Interrupt request of the PPG ch.10</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PPGINT0" -->
            <field>
              <name>PPGINT0</name>
              <description>Interrupt request of the PPG ch.8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ038MON" -->
        <register>
          <name>IRQ038MON</name>
          <description>IRQ038 Batch Read Register</description>
          <addressOffset>0x29C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PPGINT2" -->
            <field>
              <name>PPGINT2</name>
              <description>Interrupt request of the PPG ch.20</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PPGINT1" -->
            <field>
              <name>PPGINT1</name>
              <description>Interrupt request of the PPG ch.18</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PPGINT0" -->
            <field>
              <name>PPGINT0</name>
              <description>Interrupt request of the PPG ch.16</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ039MON" -->
        <register>
          <name>IRQ039MON</name>
          <description>IRQ039 Batch Read Register</description>
          <addressOffset>0x2A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>Interrupt request of source 1 (IRQ1) of the base timer ch.0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>Interrupt request of source 0 (IRQ0) of the base timer ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ040MON" -->
        <register>
          <name>IRQ040MON</name>
          <description>IRQ040 Batch Read Register</description>
          <addressOffset>0x2A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>Interrupt request of source 1 (IRQ1) of the base timer ch.1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>Interrupt request of source 0 (IRQ0) of the base timer ch.1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ041MON" -->
        <register>
          <name>IRQ041MON</name>
          <description>IRQ041 Batch Read Register</description>
          <addressOffset>0x2A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>Interrupt request of source 1 (IRQ1) of the base timer ch.2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>Interrupt request of source 0 (IRQ0) of the base timer ch.2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ042MON" -->
        <register>
          <name>IRQ042MON</name>
          <description>IRQ042 Batch Read Register</description>
          <addressOffset>0x2AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>Interrupt request of source 1 (IRQ1) of the base timer ch.3</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>Interrupt request of source 0 (IRQ0) of the base timer ch.3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ043MON" -->
        <register>
          <name>IRQ043MON</name>
          <description>IRQ043 Batch Read Register</description>
          <addressOffset>0x2B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>Interrupt request of source 1 (IRQ1) of the base timer ch.4</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>Interrupt request of source 0 (IRQ0) of the base timer ch.4</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ044MON" -->
        <register>
          <name>IRQ044MON</name>
          <description>IRQ044 Batch Read Register</description>
          <addressOffset>0x2B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>Interrupt request of source 1 (IRQ1) of the base timer ch.5</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>Interrupt request of source 0 (IRQ0) of the base timer ch.5</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
