lkolbly/cmsis-svd/data/Cypress/S6E2DF.svd
        <!-- REGISTER "ATIM3" -->
        <register derivedFrom="ATIM0">
          <name>ATIM3</name>
          <description>ALE Timing Register 3</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "ATIM4" -->
        <register derivedFrom="ATIM0">
          <name>ATIM4</name>
          <description>ALE Timing Register 4</description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "ATIM5" -->
        <register derivedFrom="ATIM0">
          <name>ATIM5</name>
          <description>ALE Timing Register 5</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "ATIM6" -->
        <register derivedFrom="ATIM0">
          <name>ATIM6</name>
          <description>ALE Timing Register 6</description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "ATIM7" -->
        <register derivedFrom="ATIM0">
          <name>ATIM7</name>
          <description>ALE Timing Register 7</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "SDMODE" -->
        <register>
          <name>SDMODE</name>
          <description>SDRAM Mode Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001300</resetValue>
          <resetMask>0x0001FF37</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSDCLKOFF" -->
            <field>
              <name>MSDCLKOFF</name>
              <description>MSDCLK OFF</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BASEL" -->
            <field>
              <name>BASEL</name>
              <description>Bank Address Select</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RASEL" -->
            <field>
              <name>RASEL</name>
              <description>Row Address Select</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CASEL" -->
            <field>
              <name>CASEL</name>
              <description>Column Address Select</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ROFF" -->
            <field>
              <name>ROFF</name>
              <description>Refresh OFF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PDON" -->
            <field>
              <name>PDON</name>
              <description>Power Down ON</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDON" -->
            <field>
              <name>SDON</name>
              <description>SDRAM ON</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "REFTIM" -->
        <register>
          <name>REFTIM</name>
          <description>Refresh Timer Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000033</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PREF" -->
            <field>
              <name>PREF</name>
              <description>Pre-Refresh</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NREF" -->
            <field>
              <name>NREF</name>
              <description>Number of Refresh</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REFC" -->
            <field>
              <name>REFC</name>
              <description>Refresh Count</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWRDWN" -->
        <register>
          <name>PWRDWN</name>
          <description>Power Down Count Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PDC" -->
            <field>
              <name>PDC</name>
              <description>Power Down Count</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SDTIM" -->
        <register>
          <name>SDTIM</name>
          <description>SDRAM Timing Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00420000</resetValue>
          <resetMask>0x83FFFFF3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BOFF" -->
            <field>
              <name>BOFF</name>
              <description>Buffer readout bit</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TDPL" -->
            <field>
              <name>TDPL</name>
              <description>Data-in to Precharge Lead Time</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TREFC" -->
            <field>
              <name>TREFC</name>
              <description>Refresh Cycle time</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRAS" -->
            <field>
              <name>TRAS</name>
              <description>RAS active time</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRCD" -->
            <field>
              <name>TRCD</name>
              <description>RAS-CAS Delay</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRP" -->
            <field>
              <name>TRP</name>
              <description>RAS Precharge time</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRC" -->
            <field>
              <name>TRC</name>
              <description>RAS Cycle time</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CL" -->
            <field>
              <name>CL</name>
              <description>CAS Latency</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SDCMD" -->
        <register>
          <name>SDCMD</name>
          <description>SDRAM Command Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x801FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PEND" -->
            <field>
              <name>PEND</name>
              <description>Pend</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDCKE" -->
            <field>
              <name>SDCKE</name>
              <description>SDRAM CKE</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCS" -->
            <field>
              <name>SDCS</name>
              <description>SDRAM Chip Select</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDRAS" -->
            <field>
              <name>SDRAS</name>
              <description>SDRAM RAS</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCAS" -->
            <field>
              <name>SDCAS</name>
              <description>SDRAM CAS</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDWE" -->
            <field>
              <name>SDWE</name>
              <description>SDRAM Write Enable</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDAD" -->
            <field>
              <name>SDAD</name>
              <description>SDRAM ADress</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MEMCERR" -->
        <register>
          <name>MEMCERR</name>
          <description>Memory Controller Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDION" -->
            <field>
              <name>SDION</name>
              <description>SDRAM error Interrupt ON</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SFION" -->
            <field>
              <name>SFION</name>
              <description>SRAM/Flash error Interrupt ON</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDER" -->
            <field>
              <name>SDER</name>
              <description>SDRAM Error</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SFER" -->
            <field>
              <name>SFER</name>
              <description>SRAM/Flash Error</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DCLKR" -->
        <register>
          <name>DCLKR</name>
          <description>Division Clock Register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MCLKON" -->
            <field>
              <name>MCLKON</name>
              <description>MCLK ON</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDIV" -->
            <field>
              <name>MDIV</name>
              <description>MCLK Division Ratio Setup</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EST" -->
        <register>
          <name>EST</name>
          <description>Error Status Register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WERR" -->
            <field>
              <name>WERR</name>
              <description>WERR</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WEAD" -->
        <register>
          <name>WEAD</name>
          <description>Write Error Address Register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
