lkolbly/cmsis-svd/data/Cypress/S6E2DF.svd
        <!-- REGISTER "PFRF" -->
        <register>
          <name>PFRF</name>
          <description>Port Function Setting Register F</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PCR0" -->
        <register derivedFrom="PFR0">
          <name>PCR0</name>
          <description>Pull-up Setting Register 0</description>
          <addressOffset>0x100</addressOffset>
        </register>
        <!-- REGISTER "PCR1" -->
        <register derivedFrom="PFR1">
          <name>PCR1</name>
          <description>Pull-up Setting Register 1</description>
          <addressOffset>0x104</addressOffset>
        </register>
        <!-- REGISTER "PCR2" -->
        <register derivedFrom="PFR2">
          <name>PCR2</name>
          <description>Pull-up Setting Register 2</description>
          <addressOffset>0x108</addressOffset>
        </register>
        <!-- REGISTER "PCR3" -->
        <register derivedFrom="PFR3">
          <name>PCR3</name>
          <description>Pull-up Setting Register 3</description>
          <addressOffset>0x10C</addressOffset>
        </register>
        <!-- REGISTER "PCR4" -->
        <register derivedFrom="PFR4">
          <name>PCR4</name>
          <description>Pull-up Setting Register 4</description>
          <addressOffset>0x110</addressOffset>
        </register>
        <!-- REGISTER "PCR5" -->
        <register derivedFrom="PFR5">
          <name>PCR5</name>
          <description>Pull-up Setting Register 5</description>
          <addressOffset>0x114</addressOffset>
        </register>
        <!-- REGISTER "PCR6" -->
        <register derivedFrom="PFR6">
          <name>PCR6</name>
          <description>Pull-up Setting Register 6</description>
          <addressOffset>0x118</addressOffset>
        </register>
        <!-- REGISTER "PCR7" -->
        <register derivedFrom="PFR7">
          <name>PCR7</name>
          <description>Pull-up Setting Register 7</description>
          <addressOffset>0x11C</addressOffset>
        </register>
        <!-- REGISTER "PCR8" -->
        <register>
          <name>PCR8</name>
          <description>Pull-up Setting Register 8</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PCR9" -->
        <register derivedFrom="PFR9">
          <name>PCR9</name>
          <description>Pull-up Setting Register 9</description>
          <addressOffset>0x124</addressOffset>
        </register>
        <!-- REGISTER "PCRA" -->
        <register derivedFrom="PFRA">
          <name>PCRA</name>
          <description>Pull-up Setting Register A</description>
          <addressOffset>0x128</addressOffset>
        </register>
        <!-- REGISTER "PCRB" -->
        <register derivedFrom="PFRB">
          <name>PCRB</name>
          <description>Pull-up Setting Register B</description>
          <addressOffset>0x12C</addressOffset>
        </register>
        <!-- REGISTER "PCRC" -->
        <register derivedFrom="PFRC">
          <name>PCRC</name>
          <description>Pull-up Setting Register C</description>
          <addressOffset>0x130</addressOffset>
        </register>
        <!-- REGISTER "PCRD" -->
        <register derivedFrom="PFRD">
          <name>PCRD</name>
          <description>Pull-up Setting Register D</description>
          <addressOffset>0x134</addressOffset>
        </register>
        <!-- REGISTER "PCRE" -->
        <register derivedFrom="PFRE">
          <name>PCRE</name>
          <description>Pull-up Setting Register E</description>
          <addressOffset>0x138</addressOffset>
        </register>
        <!-- REGISTER "PCRF" -->
        <register derivedFrom="PFRF">
          <name>PCRF</name>
          <description>Pull-up Setting Register F</description>
          <addressOffset>0x13C</addressOffset>
        </register>
        <!-- REGISTER "DDR0" -->
        <register>
          <name>DDR0</name>
          <description>Port input/output Direction Setting Register 0</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P0E" -->
            <field>
              <name>P0E</name>
              <description>Bit14 of DDR0</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0D" -->
            <field>
              <name>P0D</name>
              <description>Bit13 of DDR0</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0C" -->
            <field>
              <name>P0C</name>
              <description>Bit12 of DDR0</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0B" -->
            <field>
              <name>P0B</name>
              <description>Bit11 of DDR0</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0A" -->
            <field>
              <name>P0A</name>
              <description>Bit10 of DDR0</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P09" -->
            <field>
              <name>P09</name>
              <description>Bit9 of DDR0</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P08" -->
            <field>
              <name>P08</name>
              <description>Bit8 of DDR0</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P07" -->
            <field>
              <name>P07</name>
              <description>Bit7 of DDR0</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P06" -->
            <field>
              <name>P06</name>
              <description>Bit6 of DDR0</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P05" -->
            <field>
              <name>P05</name>
              <description>Bit5 of DDR0</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P04" -->
            <field>
              <name>P04</name>
              <description>Bit4 of DDR0</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P03" -->
            <field>
              <name>P03</name>
              <description>Bit3 of DDR0</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P02" -->
            <field>
              <name>P02</name>
              <description>Bit2 of DDR0</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P01" -->
            <field>
              <name>P01</name>
              <description>Bit1 of DDR0</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P00" -->
            <field>
              <name>P00</name>
              <description>Bit0 of DDR0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DDR1" -->
        <register derivedFrom="PFR1">
          <name>DDR1</name>
          <description>Port input/output Direction Setting Register 1</description>
          <addressOffset>0x204</addressOffset>
        </register>
        <!-- REGISTER "DDR2" -->
        <register derivedFrom="PFR2">
          <name>DDR2</name>
          <description>Port input/output Direction Setting Register 2</description>
          <addressOffset>0x208</addressOffset>
        </register>
        <!-- REGISTER "DDR3" -->
        <register derivedFrom="PFR3">
          <name>DDR3</name>
          <description>Port input/output Direction Setting Register 3</description>
          <addressOffset>0x20C</addressOffset>
        </register>
        <!-- REGISTER "DDR4" -->
        <register derivedFrom="PFR4">
          <name>DDR4</name>
          <description>Port input/output Direction Setting Register 4</description>
          <addressOffset>0x210</addressOffset>
        </register>
        <!-- REGISTER "DDR5" -->
        <register derivedFrom="PFR5">
          <name>DDR5</name>
          <description>Port input/output Direction Setting Register 5</description>
          <addressOffset>0x214</addressOffset>
        </register>
        <!-- REGISTER "DDR6" -->
        <register derivedFrom="PFR6">
          <name>DDR6</name>
          <description>Port input/output Direction Setting Register 6</description>
          <addressOffset>0x218</addressOffset>
        </register>
