lkolbly/cmsis-svd/data/Cypress/S6E2DF.svd
        <!-- REGISTER "EPFR29" -->
        <register>
          <name>EPFR29</name>
          <description>Extended Pin Function Setting Register 29</description>
          <addressOffset>0x674</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFCFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PNL_TSIG11E" -->
            <field>
              <name>PNL_TSIG11E</name>
              <description>PNL_TSIG11 Output Select bits</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_TSIG10E" -->
            <field>
              <name>PNL_TSIG10E</name>
              <description>PNL_TSIG10 Output Select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_TSIG9E" -->
            <field>
              <name>PNL_TSIG9E</name>
              <description>PNL_TSIG9 Output Select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_TSIG8E" -->
            <field>
              <name>PNL_TSIG8E</name>
              <description>PNL_TSIG8 Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_TSIG7E" -->
            <field>
              <name>PNL_TSIG7E</name>
              <description>PNL_TSIG7 Output Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_TSIG6E" -->
            <field>
              <name>PNL_TSIG6E</name>
              <description>PNL_TSIG6 Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_TSIG5E" -->
            <field>
              <name>PNL_TSIG5E</name>
              <description>PNL_TSIG5 Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD23E" -->
            <field>
              <name>PNL_PD23E</name>
              <description>PNL_TSIG23 Output Select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD22E" -->
            <field>
              <name>PNL_PD22E</name>
              <description>PNL_TSIG22 Output Select bits</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD21E" -->
            <field>
              <name>PNL_PD21E</name>
              <description>PNL_TSIG21 Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD20E" -->
            <field>
              <name>PNL_PD20E</name>
              <description>PNL_TSIG20 Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD19E" -->
            <field>
              <name>PNL_PD19E</name>
              <description>PNL_TSIG19 Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD18E" -->
            <field>
              <name>PNL_PD18E</name>
              <description>PNL_TSIG18 Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD17E" -->
            <field>
              <name>PNL_PD17E</name>
              <description>PNL_TSIG17 Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PD16E" -->
            <field>
              <name>PNL_PD16E</name>
              <description>PNL_TSIG16 Output Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR30" -->
        <register>
          <name>EPFR30</name>
          <description>Extended Pin Function Setting Register 30</description>
          <addressOffset>0x678</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF0FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PNL_TSIG4E" -->
            <field>
              <name>PNL_TSIG4E</name>
              <description>PNL_TSIG4 Output Select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_TSIG3E" -->
            <field>
              <name>PNL_TSIG3E</name>
              <description>PNL_TSIG3 Output Select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_TSIG2E" -->
            <field>
              <name>PNL_TSIG2E</name>
              <description>PNL_TSIG2 Output Select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_TSIG1E" -->
            <field>
              <name>PNL_TSIG1E</name>
              <description>PNL_TSIG1 Output Select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_TSIG0E" -->
            <field>
              <name>PNL_TSIG0E</name>
              <description>PNL_TSIG0 Output Select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_LH_SYNCE" -->
            <field>
              <name>PNL_LH_SYNCE</name>
              <description>PNL_LH_SYNC Output Select bits</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_FV_SYNCE" -->
            <field>
              <name>PNL_FV_SYNCE</name>
              <description>PNL_FV_SYNC Output Select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_LEE" -->
            <field>
              <name>PNL_LEE</name>
              <description>PNL_LE Output Select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_DENE" -->
            <field>
              <name>PNL_DENE</name>
              <description>PNL_DEN Output Select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_DCLKE" -->
            <field>
              <name>PNL_DCLKE</name>
              <description>PNL_DCLK Output Select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PNL_PWEE" -->
            <field>
              <name>PNL_PWEE</name>
              <description>PNL_PWE Output Select bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
