lkolbly/cmsis-svd/data/Cypress/S6E2DF.svd
        <!-- REGISTER "PZR0" -->
        <register derivedFrom="DDR0">
          <name>PZR0</name>
          <description>Port Pseudo Open Drain Setting Register 0</description>
          <addressOffset>0x700</addressOffset>
        </register>
        <!-- REGISTER "PZR1" -->
        <register derivedFrom="DDR1">
          <name>PZR1</name>
          <description>Port Pseudo Open Drain Setting Register 1</description>
          <addressOffset>0x704</addressOffset>
        </register>
        <!-- REGISTER "PZR2" -->
        <register derivedFrom="DDR2">
          <name>PZR2</name>
          <description>Port Pseudo Open Drain Setting Register 2</description>
          <addressOffset>0x708</addressOffset>
        </register>
        <!-- REGISTER "PZR3" -->
        <register derivedFrom="DDR3">
          <name>PZR3</name>
          <description>Port Pseudo Open Drain Setting Register 3</description>
          <addressOffset>0x70C</addressOffset>
        </register>
        <!-- REGISTER "PZR4" -->
        <register derivedFrom="DDR4">
          <name>PZR4</name>
          <description>Port Pseudo Open Drain Setting Register 4</description>
          <addressOffset>0x710</addressOffset>
        </register>
        <!-- REGISTER "PZR5" -->
        <register derivedFrom="DDR5">
          <name>PZR5</name>
          <description>Port Pseudo Open Drain Setting Register 5</description>
          <addressOffset>0x714</addressOffset>
        </register>
        <!-- REGISTER "PZR6" -->
        <register derivedFrom="DDR6">
          <name>PZR6</name>
          <description>Port Pseudo Open Drain Setting Register 6</description>
          <addressOffset>0x718</addressOffset>
        </register>
        <!-- REGISTER "PZR7" -->
        <register derivedFrom="DDR7">
          <name>PZR7</name>
          <description>Port Pseudo Open Drain Setting Register 7</description>
          <addressOffset>0x71C</addressOffset>
        </register>
        <!-- REGISTER "PZR8" -->
        <register derivedFrom="DDR8">
          <name>PZR8</name>
          <description>Port Pseudo Open Drain Setting Register 8</description>
          <addressOffset>0x720</addressOffset>
        </register>
        <!-- REGISTER "PZR9" -->
        <register derivedFrom="DDR9">
          <name>PZR9</name>
          <description>Port Pseudo Open Drain Setting Register 9</description>
          <addressOffset>0x724</addressOffset>
        </register>
        <!-- REGISTER "PZRA" -->
        <register derivedFrom="DDRA">
          <name>PZRA</name>
          <description>Port Pseudo Open Drain Setting Register A</description>
          <addressOffset>0x728</addressOffset>
        </register>
        <!-- REGISTER "PZRB" -->
        <register derivedFrom="DDRB">
          <name>PZRB</name>
          <description>Port Pseudo Open Drain Setting Register B</description>
          <addressOffset>0x72C</addressOffset>
        </register>
        <!-- REGISTER "PZRC" -->
        <register derivedFrom="DDRC">
          <name>PZRC</name>
          <description>Port Pseudo Open Drain Setting Register C</description>
          <addressOffset>0x730</addressOffset>
        </register>
        <!-- REGISTER "PZRD" -->
        <register derivedFrom="DDRD">
          <name>PZRD</name>
          <description>Port Pseudo Open Drain Setting Register D</description>
          <addressOffset>0x734</addressOffset>
        </register>
        <!-- REGISTER "PZRE" -->
        <register derivedFrom="DDRE">
          <name>PZRE</name>
          <description>Port Pseudo Open Drain Setting Register E</description>
          <addressOffset>0x738</addressOffset>
        </register>
        <!-- REGISTER "PZRF" -->
        <register derivedFrom="DDRF">
          <name>PZRF</name>
          <description>Port Pseudo Open Drain Setting Register F</description>
          <addressOffset>0x73C</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "PCRC" -->
    <peripheral>
      <name>PCRC</name>
      <description>0</description>
      <version>A</version>
      <groupName>PCRC</groupName>
      <baseAddress>0x40080000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "PRGCRC_I2S" -->
      <interrupt>
        <name>PRGCRC_I2S</name>
        <value>117</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "PRGCRC_POLY" -->
        <register>
          <name>PRGCRC_POLY</name>
          <description>CRC Computing Generator Polynomial Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x04C11DB7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PRGCRC_SEED" -->
        <register>
          <name>PRGCRC_SEED</name>
          <description>CRC Computing Initial Value Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PRGCRC_FXOR" -->
        <register>
          <name>PRGCRC_FXOR</name>
          <description>CRC Computing Resault XOR Value Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "PRGCRC_CFG" -->
        <register>
          <name>PRGCRC_CFG</name>
          <description>CRC Computing Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00E00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LOCK" -->
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CDEN" -->
            <field>
              <name>CDEN</name>
              <description>DMA request enable</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIEN" -->
            <field>
              <name>CIEN</name>
              <description>Interrupt request enable</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIRQ" -->
            <field>
              <name>CIRQ</name>
              <description>Interrupt request</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SZ" -->
            <field>
              <name>SZ</name>
              <description>Input data size</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEST" -->
            <field>
              <name>TEST</name>
              <description>Test</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FI" -->
            <field>
              <name>FI</name>
              <description>Input data format</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FO" -->
            <field>
              <name>FO</name>
              <description>output data format</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CIRQCLR" -->
            <field>
              <name>CIRQCLR</name>
              <description>Interrupt request clear</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRGCRC_WR" -->
        <register>
          <name>PRGCRC_WR</name>
          <description>CRC Computing Input Data Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
