lkolbly/cmsis-svd/data/Cypress/S6E2DF.svd
        <!-- REGISTER "SDRAMC_DomainControl" -->
        <register>
          <name>SDRAMC_DomainControl</name>
          <description>SDRAM interface clock domain setting register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0x00010001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDRAMC_SoftwareReset" -->
            <field>
              <name>SDRAMC_SoftwareReset</name>
              <description>Software reset for SDRAM interface clock domain</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDRAMC_ClockEnable" -->
            <field>
              <name>SDRAMC_ClockEnable</name>
              <description>SDRAM interface clock output control</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIC_ClockDivider" -->
        <register>
          <name>HSSPIC_ClockDivider</name>
          <description>Division Ratio of QSPI interface setting register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <resetMask>0x00FFFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HSSPIC_ClockDivider" -->
            <field>
              <name>HSSPIC_ClockDivider</name>
              <description>Division Ratio from the Reference clock for peripherals</description>
              <msb>23</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIC_DomainControl" -->
        <register>
          <name>HSSPIC_DomainControl</name>
          <description>QSPI interface clock domain setting register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0x00010001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HSSPIC_SoftwareReset" -->
            <field>
              <name>HSSPIC_SoftwareReset</name>
              <description>Software reset for QSPI interface clock domain</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HSSPIC_ClockEnable" -->
            <field>
              <name>HSSPIC_ClockEnable</name>
              <description>QSPI interface clock output control</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RPCC_ClockDivider" -->
        <register>
          <name>RPCC_ClockDivider</name>
          <description>Division Ratio of HyperBus interface setting register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RPCC_ClockDivider" -->
            <field>
              <name>RPCC_ClockDivider</name>
              <description>Division Ratio from the Reference clock for peripherals</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RPCC_DomainControl" -->
        <register>
          <name>RPCC_DomainControl</name>
          <description>HyperBus interface clock domain setting register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RPCC_ClockEnable" -->
            <field>
              <name>RPCC_ClockEnable</name>
              <description>HyperBus interface clock output control</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "vram_LockUnlock" -->
        <register>
          <name>vram_LockUnlock</name>
          <description>VRAM LockUnlock Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "vram_LockUnlock" -->
            <field>
              <name>vram_LockUnlock</name>
              <description>$</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "vram_LockStatus" -->
        <register>
          <name>vram_LockStatus</name>
          <description>$</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000111</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "vram_FreezeStatus" -->
            <field>
              <name>vram_FreezeStatus</name>
              <description>Current status of freeze status</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "vram_PrivilegeStatus" -->
            <field>
              <name>vram_PrivilegeStatus</name>
              <description>Current status of previlege protection</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "vram_LockStatus" -->
            <field>
              <name>vram_LockStatus</name>
              <description>Current status of lock protection</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
